tutorials/initializeAtmosphere/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (air water);

air
{
    type basic;
    thermoType
    {
        transport   const;
        thermo      eConst;
        equationOfState stiffenedGas;
    }
    equationOfState
    {
        gamma           1.4;
        a               0;
    }
    specie
    {
        molWeight       28.97;
    }
    transport
    {
        mu              0;              // Viscosity
        Pr              1;              // Prandtl number
    }
    thermodynamics
    {
        Cv          718;           // Heat capacity
        Hf          0.0;
    }

    residualRho     1e-6;
    residualAlpha   1e-6;
}



water
{
    type basic;
    thermoType
    {
        transport   const;
        thermo      eConst;
        equationOfState linearTillotson;
    }
    equationOfState
    {
        p0      1e5;
        rho0    1000.0;
        e0      3.542e5;
        omega   0.28;
        A       2.2e9;
        B       9.94e9;
        C       14.57e9;
        pCav    5000;
    }
    specie
    {
        molWeight       18;
    }
    transport
    {
        mu              0;
        Pr              1;
    }
    thermodynamics
    {
        type        eConst;
        Cv          2400; // Give correct reference temperature
        Hf          0;
    }

    residualRho     1e-6;
    residualAlpha   1e-10;
}

// ************************************************************************* //
