tutorials/initializeAtmosphere/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // this domain is slightly larger than the bounds of the geometry in the stl
    ( -1  -10  0 ) // bottom
    (  1  -10  0 )
    (  1   10  0 )
    ( -1   10  0 )
    ( -1  -10  0.1) // top
    (  1  -10  0.1)
    (  1   10  0.1)
    ( -1   10  0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 200 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (3 0 7 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
